app/controllers/devise/registrations_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = '' LIMIT 1
---
  def create
    build_resource
    puts "resource -- email:::::::: #{resource.email}"

    existing_user = User.where(:email => resource.email)