app/controllers/devise/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = '' LIMIT 1
---
  def create
    user_email = User.find_by_email(resource_params['email'])